app/controllers/graczs_controller.rb

SELECT "graczs".* FROM "graczs"
---
  def index
    @graczs = Gracz.all

INSERT INTO "graczs" ("imie", "nazwisko", "nick", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["imie", "Damian"], ["nazwisko", "Kładny"], ["nick", "Zuoo_"], ["team_id", 1], ["created_at", "2018-01-26 01:13:53.896280"], ["updated_at", "2018-01-26 01:13:53.896280"]]
---
  def create
    @gracz = Gracz.new(gracz_params)

    respond_to do |format|
      if @gracz.save

DELETE FROM "graczs" WHERE "graczs"."id" = ?  [["id", 2]]
---
  def destroy
    @gracz.destroy

SELECT  "graczs".* FROM "graczs" WHERE "graczs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_gracz
      @gracz = Gracz.find(params[:id])