app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "skrot", "pochodzenie", "sponsorzy", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Cloud 9"], ["skrot", "C9"], ["pochodzenie", "USA"], ["sponsorzy", "Milka"], ["created_at", "2018-01-26 01:10:07.170312"], ["updated_at", "2018-01-26 01:10:07.170312"]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save