app/views/graczs/_form.html.erb

SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC
---
    <%= form.label :Team_id %>
    <%= form.collection_select :team_id, Team.order(:name), :id, :name %>